---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleColorSettingsType.SolidColorRanges
enum: Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleColorSettingsType
source: html/5f1e5c03-407b-53fc-8902-1228734907ff.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleColorSettingsType.SolidColorRanges

Intermediate and min/max color settings define ranges in which the color is constant.